Tekla.Structures.Model.BaseRebarGroup
The BaseRebarGroup class is an abstract base class that represents reinforcing bar group classes.
The reinforcing bar groups derived from the base group are the rebar group, the circled rebar group
and the curved rebar group.

Tekla.Structures.Model.BaseRebarGroup.Size
The size of the reinforcement.

Tekla.Structures.Model.BaseRebarGroup.StartHook
The hook at the beginning of the reinforcing bar.

Tekla.Structures.Model.BaseRebarGroup.EndHook
The hook at the end of the reinforcing bar.

Tekla.Structures.Model.BaseRebarGroup.FromPlaneOffset
The offset value from the part surface applied in both sides.

Tekla.Structures.Model.BaseRebarGroup.StartFromPlaneOffset
The start offset value from the part surface.

Tekla.Structures.Model.BaseRebarGroup.EndFromPlaneOffset
The end offset value from the part surface.

Tekla.Structures.Model.BaseRebarGroup.ExcludeType
Defines which bars to omit from the group. The options are:
EXCLUDE_TYPE_NONE
EXCLUDE_TYPE_FIRST
EXCLUDE_TYPE_LAST
EXCLUDE_TYPE_BOTH

Tekla.Structures.Model.BaseRebarGroup.Polygons
An array list of polygons for the reinforcing bar group. Each polygon must have an equal number of points.

Tekla.Structures.Model.BaseRebarGroup.SpacingType
The type of spacing. The options are (BaseRebarGroup.RebarGroupSpacingTypeEnum.):
SPACING_TYPE_UNDEFINED
SPACING_TYPE_EXACT_SPACINGS
SPACING_TYPE_EXACT_NUMBER
SPACING_TYPE_TARGET_SPACE
SPACING_TYPE_EXACT_SPACE_FLEX_AT_START
SPACING_TYPE_EXACT_SPACE_FLEX_AT_END
SPACING_TYPE_EXACT_SPACE_FLEX_AT_BOTH
SPACING_TYPE_EXACT_SPACE_FLEX_AT_MIDDLE

Tekla.Structures.Model.BaseRebarGroup.Spacings
The spacing value(s).
If the type of the spacing is SPACING_TYPE_EXACT_NUMBER
Spacings has only one value that defines the number of the reinforcing bars.

Tekla.Structures.Model.BaseRebarGroup._Type
The subtype of group(group, curved, cicle).

Tekla.Structures.Model.BaseRebarGroup.StartPoint
The start point of the direction in which the bars are distributed.

Tekla.Structures.Model.BaseRebarGroup.EndPoint
The end point of the direction in which the bars are distributed.

Tekla.Structures.Model.BaseRebarGroup.#ctor
Initializes a new base rebar group instance with empty attributes.